---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.SetDown
source: html/a6b3a1bd-acd6-6ed0-ff42-00cf4ef48d18.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.SetDown Property

The abbreviation of the Set Down from top (TD) of fitting string.

## Syntax (C#)
```csharp
public string SetDown { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null